Repository: RundizBones/ModuleCMSA
Catalog: languages/translations/rdbcmsa-*.po
Languages: th

source: Updated successfully.
th: ปรับปรุงเรียบร้อยแล้ว.

source: Unable to delete.
th: ไม่สามารถลบได้.

source: Contents
th: เนื้อหา

source: Categories
th: หมวดหมู่

source: Please enter the name.
th: กรุณากรอกชื่อ.

source: The URL is already exists.
th: URL นี้มีอยู่แล้ว.

source: Invalid translation matcher from source ID.
th: ค่าไอดีจากแหล่งที่มาจากการจับคู่การแปลภาษาไม่ถูกต้อง.

source: Could not found the ID from source.
th: ไม่พบ ID จากแหล่งที่มา.

source: The translation you are trying to match is already exists.
th: การแปลภาษาที่คุณพยายามจะจับคู่นั้นมีข้อมูลอยู่แล้ว.

source: Added successfully.
th: เพิ่มเรียบร้อยแล้ว.

source: Unable to add new category.
th: ไม่สามารถเพิ่มหมวดหมู่.

source: Add a category
th: เพิ่มหมวดหมู่

source: Not found selected category.
th: ไม่พบหมวดหมู่ที่เลือก.

source: The parent category must not under the children of editing category.
th: หมวดหมู่ผู้ปกครองจะต้องไม่อยู่ต่ำกว่าหมวดหมู่ที่กำลังแก้ไขอยู่.

source: Unable to update.
th: ไม่สามารถปรับปรุงได้.

source: Edit a category
th: แก้ไขหมวดหมู่

source: Please select at least one category.
th: โปรดเลือกอย่างน้อยหนึ่งหมวดหมู่.

source: Published
th: เผยแพร่แล้ว

source: Unpublished
th: ไม่เผยแพร่

source: The selected file is not an image. (%1$s)
th: ไฟล์ที่เลือกไม่ใช่รูปภาพ. (%1$s)

source: Files
th: ไฟล์

source: Please select the file.
th: กรุณาเลือกไฟล์.

source: Uploaded successfully.
th: อัพโหลดเรียบร้อยแล้ว.

source: File browser
th: ไฟล์เบราว์เซอร์

source: Please select at least one item.
th: โปรดเลือกอย่างน้อยหนึ่งรายการ.

source: Not found selected item.
th: ไม่พบรายการที่เลือก.

source: Edit file data
th: แก้ไขข้อมูลไฟล์

source: Image dimension
th: ขนาดภาพ

source: Video dimension
th: ขนาดวีดีโอ

source: Could not delete the root folder.
th: ไม่สามารถลบโฟลเดอร์หลัก.

source: Unable to delete restricted folder.
th: ไม่สามารถลบโฟลเดอร์ที่ถูกจำกัด.

source: The selected folder is not exists, please check again.
th: โฟลเดอร์ที่ถูกเลือกไม่มีอยู่, โปรดตรวจสอบอีกครั้ง.

source: Unable to delete selected folder. %s
th: ไม่สามารถลบโฟลเดอร์ที่เลือก. %s

source: Please enter the folder name.
th: กรุณากรอกชื่อโฟลเดอร์.

source: The target location to create new folder is not exists, please check again.
th: ตำแหน่งเป้าหมายที่จะสร้างโฟลเดอร์ใหม่นั้นไม่มีอยู่, โปรดตรวจสอบอีกครั้ง.

source: Please enter valid characters for new folder name. Suggested: %s
th: กรุณากรอกอักขระที่ถูกต้องสำหรับชื่อโฟลเดอร์. แนะนำ: %s

source: The folder name is already exists.
th: ชื่อโฟลเดอร์นี้มีอยู่แล้ว.

source: New folder was created successfully.
th: โฟลเดอร์ใหม่ถูกสร้างเรียบร้อยแล้ว.

source: Unable to create new folder.
th: ไม่สามารถสร้างโฟลเดอร์ใหม่.

source: Unable to rename restricted folder.
th: ไม่สามารถเปลี่ยนชื่อโฟลเดอร์ที่ถูกจำกัด.

source: The folder name is already exists. (%s)
th: ชื่อโฟลเดอร์นี้มีอยู่แล้ว. (%s)

source: Success.
th: สำเร็จ.

source: Unable to rename folder.
th: ไม่สามารถเปลี่ยนชื่อโฟลเดอร์.

source: The selected file was not found.
th: ไม่พบไฟล์ที่เลือก.

source: All files in this folder will be deleted.
th: ไฟล์ทั้งหมดในโฟลเดอร์นี้จะถูกลบ.

source: Are you sure to delete selected folder?
th: คุณแน่ใจหรือไม่ที่จะลบโฟลเดอร์ที่เลือก?

source: Add: %s
th: เพิ่ม: %s

source: Update: %s
th: ปรับปรุง: %s

source: Unable to move file %1$s to %2$s.
th: ไม่สามารถย้ายไฟล์ %1$s ไปยัง %2$s.

source: Moved successfully.
th: ย้ายเรียบร้อยแล้ว.

source: Unable to move.
th: ไม่สามารถย้ายได้.

source: Already indexed files: %1$s.
th: ไฟล์ที่ทำดัชนีแล้ว: %1$s.

source: Files not exists: %1$s.
th: ไฟล์ที่ไม่มีอยู่จริง: %1$s.

source: The file was indexed successfully.
th: ไฟล์ถูกทำดัชนีเรียบร้อยแล้ว.

source: The selected files was indexed but some files are not.%1$s
th: ไฟล์ที่เลือกถูกทำดัชนีแล้ว แต่บางไฟล์นั้นไม่ได้ทำ.%1$s

source: There are errors with selected files.%1$s
th: มีข้อผิดพลาดเกี่ยวกับไฟล์ที่เลือก.%1$s

source: Please select items to index.
th: กรุณาเลือกรายการที่จะทำดัชนี.

source: Scan for unindexed files
th: สแกนหาไฟล์ที่ไม่ได้ทำดัชนี

source: Please select at least one file.
th: โปรดเลือกอย่างน้อยหนึ่งไฟล์.

source: Move file
th: ย้ายไฟล์

source: Delete file
th: ลบไฟล์

source: The selected post IDs does not matched.
th: ไอดีของโพสต์ที่เลือกนั้นไม่ตรงกัน.

source: Unallowed action detected.
th: ตรวจพบคำสั่งการกระทำที่ไม่ได้รับอนุญาต.

source: The selected post is not in trash (ID %d).
th: รายการโพสต์ที่เลือกไม่อยู่ในถังขยะ (ไอดี %d).

source: Please enter the title.
th: กรุณากรอกหัวข้อ.

source: Please enter the published date.
th: กรุณากรอกวันที่เผยแพร่.

source: Unable to add new post.
th: ไม่สามารถเพิ่มโพสต์ใหม่.

source: Add new page
th: เพิ่มหน้าใหม่

source: Pages
th: หน้า

source: Not found selected post.
th: ไม่พบโพสต์ที่เลือก.

source: Edit page
th: แก้ไขหน้า

source: Are you sure to rollback to this item?
th: คุณแน่ใจหรือไม่ที่จะย้อนกลับไปยังรายการนี้?

source: Not found selected page.
th: ไม่พบหน้าที่เลือก.

source: Items deleted successfully.
th: รายการถูกลบเรียบร้อยแล้ว.

source: Publish: %s
th: เผยแพร่: %s

source: Unable to delete the revision that is currently in use.
th: ไม่สามารถลบชุดการปรับปรุงที่กำลังใช้งานอยู่.

source: Add new post
th: เพิ่มโพสต์ใหม่

source: Posts
th: โพสต์

source: Edit post
th: แก้ไขโพสต์

source: CMS admin settings
th: ตั้งค่าหน้าผู้ดูแลเนื้อหา

source: Are you sure to delete watermark?
th: คุณแน่ใจหรือไม่ที่จะลบลายน้ำ?

source: Please choose only one file.
th: กรุณาเลือกหนึ่งไฟล์.

source: Uploading
th: กำลังอัพโหลด

source: Unable to delete watermark file.
th: ไม่สามารถลบไฟล์ลายน้ำได้.

source: All
th: ทั้งหมด

source: Unable to add new tag.
th: ไม่สามารถเพิ่มแท็กใหม่.

source: Add a tag
th: เพิ่มแท็ก

source: Tags
th: แท็ก

source: Not found selected tag.
th: ไม่พบแท็กที่เลือก.

source: Edit a tag
th: แก้ไขแท็ก

source: Please enter the URL alias.
th: กรุณากรอก URL แฝง.

source: Please choose to enter the required fields to work as URL alias or URL redirection.
th: กรุณาเลือกกรอกช่องที่จำเป็นเพื่อให้ทำงานเป็น URL แฝงหรือเปลี่ยนเส้นทาง URL.

source: Unable to add new URL alias.
th: ไม่สามารถเพิ่ม URL แฝงใหม่.

source: Add an URL alias
th: เพิ่ม URL แฝง

source: URL Aliases
th: URL แฝง

source: Not found selected URL alias.
th: ไม่พบ URL แฝงที่เลือก.

source: Edit an URL alias
th: แก้ไข URL แฝง

source: URL aliases
th: URL แฝง

source: Use redirect function.
th: ใช้ฟังก์ชั่นการเปลี่ยนเส้นทาง.

source: The selected translation matcher IDs does not matched.
th: ไอดีของการจับคู่แปลภาษาที่เลือกนั้นไม่ตรงกัน.

source: Unable to add new matches.
th: ไม่สามารถเพิ่มการจับคู่ใหม่.

source: The translation matches data you are editing is not exists.
th: การจับคู่ข้อมูลที่คุณกำลังแก้ไขนั้นไม่มีอยู่จริง.

source: Translation matcher
th: จับคู่การแปลภาษา

source: Please select the table.
th: กรุณาเลือกตาราง.

source: Invalid matches format.
th: รูปแบบการจับคู่ไม่ถูกต้อง.

source: Please enter matched data between languages.
th: กรุณากรอกข้อมูลที่สัมพันธ์กันระหว่างภาษา.

source: The data you had entered is already exists.
th: ข้อมูลที่คุณกรอกมีอยู่แล้ว.

source: Delete category
th: ลบหมวดหมู่

source: Draft
th: ดราฟท์

source: Scheduled
th: ตั้งเวลา

source: Pending
th: รอตรวจ

source: Private
th: ส่วนตัว

source: Trash
th: ถังขยะ

source: Inherit
th: สืบทอด

source: Settings
th: ตั้งค่า

source: List items
th: แสดงรายการ

source: Add
th: เพิ่ม

source: Edit
th: แก้ไข

source: Delete
th: ลบ

source: Match
th: จับคู่

source: Update
th: ปรับปรุง

source: Move
th: ย้าย

source: File
th: ไฟล์

source: Warning!
th: คำเตือน!

source: Child entries of any selected items will also be affected.
th: รายการลูกของรายการที่ถูกเลือกใดๆจะได้รับผลกระทบไปด้วย.

source: Parent category
th: หมวดหมู่ผู้ปกครอง

source: None
th: ไม่มี

source: Name
th: ชื่อ

source: HTML will be escaped.
th: HTML จะถูกแปลง.

source: Description
th: รายละเอียด

source: HTML is allowed.
th: อนุญาตให้ใช้ HTML.

source: URL alias
th: URL แฝง

source: The name will be use on address of this category. Do not enter special characters.
th: ชื่อที่จะใช้บนที่อยู่ของหมวดนี้. อย่ากรอกอักขระพิเศษ.

source: Status
th: สถานะ

source: Any contents that is inside this category still accessible directly even if this category is unpublished.
th: เนื้อหาใดๆที่อยู่ภายในหมวดหมู่นี้จะยังเข้าถึงได้โดยตรงแม้ว่าหมวดหมู่นี้จะไม่เผยแพร่.

source: Position
th: ตำแหน่ง

source: Position of this category in the same parent.
th: ตำแหน่งของหมวดหมู่นี้ภายใต้หมวดหมู่ผู้ปกครองเดียวกัน.

source: Count
th: จำนวน

source: View
th: ดู

source: Add a translation
th: เพิ่มการแปล

source: Update total items
th: ปรับปรุงจำนวนรายการทั้งหมด

source: Target
th: เป้าหมาย

source: Found in %d post.
th: พบใน %d โพสต์.

source: The files that was linked in the posts will have status of 404 (not found error).
th: ไฟล์ต่างๆที่ถูกเชื่อมโยงในโพสต์จะมีสถานะเป็น 404 (ไม่พบไฟล์).

source: Drop the files into this area to start upload.
th: วางไฟล์ลงในพื้นที่นี้เพื่อเริ่มอัพโหลด.

source: Choose files
th: เลือกไฟล์

source: Click on choose files or drop files here to start upload.
th: คลิกที่เลือกไฟล์หรือวางไฟล์ที่นี่เพื่อเริ่มอัพโหลด.

source: Max file size %s.
th: ขนาดไฟล์สูงสุด %s.

source: Folder
th: โฟลเดอร์

source: File type
th: ประเภทไฟล์

source: Images
th: ภาพ

source: Audio
th: เสียง

source: Video
th: วีดีโอ

source: Set featured image
th: กำหนดเป็นภาพหลัก

source: Set select images
th: กำหนดรูปภาพที่เลือก

source: Link to
th: ลิ้งค์ไปยัง

source: Actual file
th: ไฟล์จริง

source: Attachment page
th: หน้าแสดงไฟล์

source: Embed media player (for video or audio, otherwise it will use attachment page).
th: ฝังตัวเล่นสื่อ (สำหรับวีดีโอหรือเสียง, นอกจากนั้นมันจะใช้หน้าแสดงไฟล์).

source: Image size
th: ขนาดภาพ

source: Original
th: ต้นฉบับ

source: If the selected resolution is not available, it will automatically use a smaller resolution or the original file.
th: ถ้าขนาดที่เลือกไม่มีอยู่, มันจะใช้ขนาดที่เล็กกว่าหรือขนาดต้นฉบับโดยอัตโนมัติ.

source: This option will be use for image only.
th: ตัวเลือกนี้จะถูกใช้สำหรับภาพเท่านั้น.

source: Insert
th: แทรก

source: Download
th: ดาวน์โหลด

source: This data will be use on public views.
th: ข้อมูลนี้จะนำไปใช้ในมุมมองสาธารณะ.

source: Keywords
th: คำค้นหา

source: HTML is not allowed.
th: ไม่อนุญาตให้ใช้ HTML.

source: Folders
th: โฟลเดอร์

source: New folder
th: โฟลเดอร์ใหม่

source: Reload
th: โหลดใหม่

source: Uploader
th: ผู้อัพโหลด

source: Size
th: ขนาด

source: Date
th: วันที่

source: Create new folder in %s
th: สร้างโฟลเดอร์ใหม่ใน %s

source: The folder that will be rename %s
th: โฟลเดอร์ที่จะเปลี่ยนชื่อ %s

source: Folder name
th: ชื่อโฟลเดอร์

source: Duration
th: ระยะเวลา

source: Apply watermark
th: นำลายน้ำไปใช้

source: Remove watermark
th: เอาลายน้ำออก

source: Update thumbnails
th: ปรับปรุงภาพย่อ

source: Update metadata
th: ปรับปรุง metadata

source: Rename
th: เปลี่ยนชื่อ

source: This can be scan for maximum %$1d files at a time.
th: นี่จะเป็นการสแกนได้มากสุด %1$d ไฟล์ต่อครั้ง.

source: Start scan
th: เริ่มสแกน

source: Scanned result
th: ผลการสแกน

source: Index selected items
th: ทำดัชนีรายการที่เลือก.

source: View this file.
th: ดูไฟล์นี้.

source: Content
th: เนื้อหา

source: HTML head
th: HTML ส่วนหัว

source: Publishing
th: การเผยแพร่

source: Revision
th: ชุดการปรับปรุง

source: Revision history
th: ประวัติการปรับปรุง

source: Title
th: หัวข้อ

source: Featured image
th: ภาพหลัก

source: Browse an image
th: เรียกดูภาพ

source: Head elements
th: แท็กต่างๆในส่วนหัว

source: Optional elements such as meta tags, additional styles, or scripts that will be render within %1$s element.
th: ทางเลือกแท็กต่างๆอย่างเช่น แท็ก meta, สไตล์ชีท, สคริปต์ ซึ่งมันจะนำไปใช้ภายในแท็ก %1$s.

source: Press %1$s to see shortcuts.
th: กด %1$s เพื่อดูปุ่มทางลัด.

source: The name will be use on address of this page. Do not enter special characters.
th: ชื่อที่จะใช้บนที่อยู่ของหน้านี้. อย่ากรอกอักขระพิเศษ.

source: Author
th: ผู้เขียน

source: Created date
th: วันที่สร้าง

source: Last update
th: ปรับปรุงล่าสุด

source: Published on
th: เผยแพร่เมื่อ

source: Please enter in format %1$s. Example: %2$s.
th: กรุณากรอกในรูปแบบ %1$s. ตัวอย่าง: %2$s.

source: New revision
th: ชุดการปรับปรุงใหม่

source: Create new revision
th: สร้างชุดการปรับปรุงใหม่

source: If you choose to create new revision, it will not overwrite the previous content.
th: ถ้าคุณเลือกสร้างชุดการปรับปรุงใหม่, มันจะไม่เขียนทับเนื้อหาก่อนหน้า.

source: Revision log
th: บันทึกการปรับปรุง

source: Save & stay
th: บันทึกและอยู่

source: Close
th: ปิด

source: Remove featured image
th: เอาภาพหลักออก

source: Move to trash
th: ย้ายลงถังขยะ

source: Restore
th: คืนค่า

source: Delete permanently
th: ลบถาวร

source: Categories & tags
th: หมวดหมู่และแท็ก

source: Summary
th: เนื้อหาย่อ

source: Loading, please wait.
th: กำลังโหลด, โปรดรอ.

source: The name will be use on address of this post. Do not enter special characters.
th: ชื่อที่จะใช้บนที่อยู่ของโพสต์นี้. อย่ากรอกอักขระพิเศษ.

source: There are no category.
th: ไม่มีหมวดหมู่.

source: Category
th: หมวดหมู่

source: Tag
th: แท็ก

source: Compare
th: เปรียบเทียบ

source: Current revision
th: ชุดการปรับปรุงที่ใช้อยู่

source: Rollback
th: ย้อนกลับ

source: Watermark
th: ลายน้ำ

source: Choose file
th: เลือกไฟล์

source: Click on choose file or drop a file here to start upload.
th: คลิกที่เลือกไฟล์หรือวางไฟล์ที่นี่เพื่อเริ่มอัพโหลด.

source: Check this box to delete current watermark.
th: ติ๊กกล่องนี้เพื่อลบลายน้ำปัจจุบัน.

source: Apply watermark on new uploaded
th: นำลายน้ำไปใช้ในการอัพโหลดใหม่

source: If apply, all new uploaded images will be use this watermark otherwise you can manually apply each file.
th: ถ้านำไปใช้, การอัพโหลดภาพใหม่ทั้งหมดจะใช้ลายน้ำนี้ ถ้ามิฉะนั้นคุณสามารถกำหนดลายน้ำให้แต่ละไฟล์ได้.

source: The name will be use on address of this tag. Do not enter special characters.
th: ชื่อที่จะใช้บนที่อยู่ของแท็กนี้. อย่ากรอกอักขระพิเศษ.

source: Original string
th: สตริงต้นฉบับ

source: This form does not store any information that you have entered.
th: ฟอร์มนี้จะไม่เก็บบันทึกข้อมูลใดๆที่คุณได้กรอกลงไป.

source: Function to use
th: ฟังก์ชั่นที่จะใช้งาน

source: Submit
th: ส่งข้อมูล

source: Result
th: ผลลัพธ์

source: Content type
th: ประเภทเนื้อหา

source: Required if you want to use URL alias function.
th: ต้องกรอกถ้าคุณต้องการใช้งานฟังก์ชั่น URL แฝง.

source: Content ID
th: ไอดีเนื้อหา

source: If you want to use URL redirect function, this is the URL the will be redirected from.
th: หากคุณต้องการใช้ฟังก์ชันเปลี่ยนเส้นทาง URL นี่คือ URL ที่จะถูกเปลี่ยนเส้นทาง.

source: Redirect to
th: เปลี่ยนเส้นทางไปยัง

source: Use the full URL or related URL start from %1$s. Do not begins with slash mark.
th: ใช้ URL แบบเต็มหรือ URL ที่เกี่ยวข้องโดยเริ่มจาก %1$s. อย่าเริ่มต้นด้วยเครื่องหมายทับ.

source: Do not URL encode.
th: ไม่ต้องเข้ารหัส URL.

source: Required if you want to use URL redirect function.
th: ต้องกรอกถ้าคุณต้องการใช้งานฟังก์ชั่นเปลี่ยนเส้นทาง URL.

source: Redirect code
th: รหัสเปลี่ยนเส้นทาง

source: %1$sHTTP status code%2$s for redirection.
th: %1$sรหัสสถานะ HTTP%2$s สำหรับการเปลี่ยนเส้นทาง.

source: Table
th: ตาราง

source: The ID of data.
th: ไอดีของข้อมูล.
